index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-09 Thu 13:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Qtile configuration file</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Kristian Alexander P" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Qtile configuration file</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org791e5ae">Qtile</a>
<ul>
<li><a href="#orgd7862d3">Default Configuration file</a>
<ul>
<li><a href="#orga9c7319">imports</a></li>
<li><a href="#org429b054">variables</a></li>
<li><a href="#org69cc669">keybindings</a></li>
<li><a href="#org594b350">groups</a></li>
<li><a href="#org6fcef20">layouts</a></li>
<li><a href="#org82e931f">default widgets and extensions</a></li>
<li><a href="#org9f91801">screens</a></li>
<li><a href="#orga4a0536">mouse</a></li>
</ul>
</li>
<li><a href="#org83fcdbb">My Configuration file</a>
<ul>
<li><a href="#org7f3df63">imports</a></li>
<li><a href="#org1a49af8">variables</a></li>
<li><a href="#org4adc307">keybindings</a></li>
<li><a href="#org7289284">groups</a></li>
<li><a href="#org6b32c17">layouts</a></li>
<li><a href="#org7d31727">default widgets and extensions</a></li>
<li><a href="#org97fd2a5">screens</a></li>
<li><a href="#org61500f7">mouse</a></li>
<li><a href="#orgc4d3302">startups</a></li>
</ul>
</li>
<li><a href="#orgea2015a">Utilities</a>
<ul>
<li><a href="#org32d8225">imports</a></li>
</ul>
</li>
<li><a href="#org6cfa5ca">External utilities</a>
<ul>
<li><a href="#orgdb37f79">rofi</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org791e5ae" class="outline-2">
<h2 id="org791e5ae">Qtile</h2>
<div class="outline-text-2" id="text-org791e5ae">
<p>
This is the configuration file for <i>qtile</i> window manager.
</p>
</div>
<div id="outline-container-orgd7862d3" class="outline-3">
<h3 id="orgd7862d3">Default Configuration file</h3>
<div class="outline-text-3" id="text-orgd7862d3">
<p>
This is the default configuration that comes from the package in <i>archlinux</i>:
</p>
</div>
<div id="outline-container-orga9c7319" class="outline-4">
<h4 id="orga9c7319">imports</h4>
<div class="outline-text-4" id="text-orga9c7319">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4169e1;">from</span> libqtile <span style="color: #4169e1;">import</span> bar, layout, qtile, widget
<span style="color: #4169e1;">from</span> libqtile.config <span style="color: #4169e1;">import</span> Click, Drag, Group, Key, Match, Screen
<span style="color: #4169e1;">from</span> libqtile.lazy <span style="color: #4169e1;">import</span> lazy
<span style="color: #4169e1;">from</span> libqtile.utils <span style="color: #4169e1;">import</span> guess_terminal
</pre>
</div>
</div>
</div>
<div id="outline-container-org429b054" class="outline-4">
<h4 id="org429b054">variables</h4>
<div class="outline-text-4" id="text-org429b054">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">mod</span> = <span style="color: #bc8f8f;">"mod4"</span>
<span style="color: #b8860b;">terminal</span> = guess_terminal()
<span style="color: #b8860b;">dgroups_key_binder</span> = <span style="color: #5f9ea0;">None</span>
<span style="color: #b8860b;">dgroups_app_rules</span> = []  <span style="color: #b22222;"># </span><span style="color: #b22222;">type: list</span>
<span style="color: #b8860b;">follow_mouse_focus</span> = <span style="color: #5f9ea0;">True</span>
<span style="color: #b8860b;">bring_front_click</span> = <span style="color: #5f9ea0;">False</span>
<span style="color: #b8860b;">floats_kept_above</span> = <span style="color: #5f9ea0;">True</span>
<span style="color: #b8860b;">cursor_warp</span> = <span style="color: #5f9ea0;">False</span>
<span style="color: #b8860b;">floating_layout</span> = layout.Floating(
    float_rules=[
        <span style="color: #b22222;"># </span><span style="color: #b22222;">Run the utility of `xprop` to see the wm class and name of an X client.</span>
        *layout.Floating.default_float_rules,
        Match(wm_class=<span style="color: #bc8f8f;">"confirmreset"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">gitk</span>
        Match(wm_class=<span style="color: #bc8f8f;">"makebranch"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">gitk</span>
        Match(wm_class=<span style="color: #bc8f8f;">"maketag"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">gitk</span>
        Match(wm_class=<span style="color: #bc8f8f;">"ssh-askpass"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">ssh-askpass</span>
        Match(title=<span style="color: #bc8f8f;">"branchdialog"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">gitk</span>
        Match(title=<span style="color: #bc8f8f;">"pinentry"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">GPG key password entry</span>
    ]
)
<span style="color: #b8860b;">auto_fullscreen</span> = <span style="color: #5f9ea0;">True</span>
<span style="color: #b8860b;">focus_on_window_activation</span> = <span style="color: #bc8f8f;">"smart"</span>
<span style="color: #b8860b;">reconfigure_screens</span> = <span style="color: #5f9ea0;">True</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">If things like steam games want to auto-minimize themselves when losing</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">focus, should we respect this or not?</span>
<span style="color: #b8860b;">auto_minimize</span> = <span style="color: #5f9ea0;">True</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">When using the Wayland backend, this can be used to configure input devices.</span>
<span style="color: #b8860b;">wl_input_rules</span> = <span style="color: #5f9ea0;">None</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">XXX: Gasp! We're lying here. In fact, nobody really uses or cares about this</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">string besides java UI toolkits; you can see several discussions on the</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">mailing lists, GitHub issues, and other WM documentation that suggest setting</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">this string if your java app doesn't work correctly. We may as well just lie</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">and say that we're a working one by default.</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">We choose LG3D to maximize irony: it is a 3D non-reparenting WM written in</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">java that happens to be on java's whitelist.</span>
<span style="color: #b8860b;">wmname</span> = <span style="color: #bc8f8f;">"LG3D"</span>
</pre>
</div>
</div>
</div>
