index.html
<div id="outline-container-org69cc669" class="outline-4">
<h4 id="org69cc669">keybindings</h4>
<div class="outline-text-4" id="text-org69cc669">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">keys</span> = [
    <span style="color: #b22222;"># </span><span style="color: #b22222;">A list of available commands that can be bound to keys can be found</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">at https://docs.qtile.org/en/latest/manual/config/lazy.html</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Switch between windows</span>
    Key([mod], <span style="color: #bc8f8f;">"h"</span>, lazy.layout.left(), desc=<span style="color: #bc8f8f;">"Move focus to left"</span>),
    Key([mod], <span style="color: #bc8f8f;">"l"</span>, lazy.layout.right(), desc=<span style="color: #bc8f8f;">"Move focus to right"</span>),
    Key([mod], <span style="color: #bc8f8f;">"j"</span>, lazy.layout.down(), desc=<span style="color: #bc8f8f;">"Move focus down"</span>),
    Key([mod], <span style="color: #bc8f8f;">"k"</span>, lazy.layout.up(), desc=<span style="color: #bc8f8f;">"Move focus up"</span>),
    Key([mod], <span style="color: #bc8f8f;">"space"</span>, lazy.layout.<span style="color: #00008b;">next</span>(), desc=<span style="color: #bc8f8f;">"Move window focus to other window"</span>),
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Move windows between left/right columns or move up/down in current stack.</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Moving out of range in Columns layout will create new column.</span>
    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"h"</span>, lazy.layout.shuffle_left(), desc=<span style="color: #bc8f8f;">"Move window to the left"</span>),
    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"l"</span>, lazy.layout.shuffle_right(), desc=<span style="color: #bc8f8f;">"Move window to the right"</span>),
    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"j"</span>, lazy.layout.shuffle_down(), desc=<span style="color: #bc8f8f;">"Move window down"</span>),
    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"k"</span>, lazy.layout.shuffle_up(), desc=<span style="color: #bc8f8f;">"Move window up"</span>),
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Grow windows. If current window is on the edge of screen and direction</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">will be to screen edge - window would shrink.</span>
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"h"</span>, lazy.layout.grow_left(), desc=<span style="color: #bc8f8f;">"Grow window to the left"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"l"</span>, lazy.layout.grow_right(), desc=<span style="color: #bc8f8f;">"Grow window to the right"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"j"</span>, lazy.layout.grow_down(), desc=<span style="color: #bc8f8f;">"Grow window down"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"k"</span>, lazy.layout.grow_up(), desc=<span style="color: #bc8f8f;">"Grow window up"</span>),
    Key([mod], <span style="color: #bc8f8f;">"n"</span>, lazy.layout.normalize(), desc=<span style="color: #bc8f8f;">"Reset all window sizes"</span>),
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Toggle between split and unsplit sides of stack.</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Split = all windows displayed</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Unsplit = 1 window displayed, like Max layout, but still with</span>
    <span style="color: #b22222;"># </span><span style="color: #b22222;">multiple stack panes</span>
    Key(
        [mod, <span style="color: #bc8f8f;">"shift"</span>],
        <span style="color: #bc8f8f;">"Return"</span>,
        lazy.layout.toggle_split(),
        desc=<span style="color: #bc8f8f;">"Toggle between split and unsplit sides of stack"</span>,
    ),
    Key([mod], <span style="color: #bc8f8f;">"Return"</span>, lazy.spawn(terminal), desc=<span style="color: #bc8f8f;">"Launch terminal"</span>),
    <span style="color: #b22222;"># </span><span style="color: #b22222;">Toggle between different layouts as defined below</span>
    Key([mod], <span style="color: #bc8f8f;">"Tab"</span>, lazy.next_layout(), desc=<span style="color: #bc8f8f;">"Toggle between layouts"</span>),
    Key([mod], <span style="color: #bc8f8f;">"w"</span>, lazy.window.kill(), desc=<span style="color: #bc8f8f;">"Kill focused window"</span>),
    Key(
        [mod],
        <span style="color: #bc8f8f;">"f"</span>,
        lazy.window.toggle_fullscreen(),
        desc=<span style="color: #bc8f8f;">"Toggle fullscreen on the focused window"</span>,
    ),
    Key([mod], <span style="color: #bc8f8f;">"t"</span>, lazy.window.toggle_floating(), desc=<span style="color: #bc8f8f;">"Toggle floating on the focused window"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"r"</span>, lazy.reload_config(), desc=<span style="color: #bc8f8f;">"Reload the config"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"q"</span>, lazy.shutdown(), desc=<span style="color: #bc8f8f;">"Shutdown Qtile"</span>),
    Key([mod], <span style="color: #bc8f8f;">"r"</span>, lazy.spawncmd(), desc=<span style="color: #bc8f8f;">"Spawn a command using a prompt widget"</span>),
]

<span style="color: #b22222;"># </span><span style="color: #b22222;">Add key bindings to switch VTs in Wayland.</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">We can't check qtile.core.name in default config as it is loaded before qtile is started</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">We therefore defer the check until the key binding is run by using .when(func=...)</span>
<span style="color: #4169e1;">for</span> vt <span style="color: #4169e1;">in</span> <span style="color: #00008b;">range</span>(1, 8):
    keys.append(
        Key(
            [<span style="color: #bc8f8f;">"control"</span>, <span style="color: #bc8f8f;">"mod1"</span>],
            f<span style="color: #bc8f8f;">"f{vt}"</span>,
            lazy.core.change_vt(vt).when(func=<span style="color: #4169e1;">lambda</span>: qtile.core.name == <span style="color: #bc8f8f;">"wayland"</span>),
            desc=f<span style="color: #bc8f8f;">"Switch to VT{vt}"</span>,
        )
    )

</pre>
</div>
</div>
</div>
