index.org
*** variables
#+begin_src python
mod = "mod4"

terminal = getenv("TERMINAL") or guess_terminal()
filemanager = getenv("FILE") or "thunar"
browser = getenv("BROWSER") or "firefox"
mail_app = getenv("MAIL_APP") or "thunderbird"
guiemacs = "emacsclient -c -a emacs"
tuiemacs = "emacsclient -t -a emacs"
visual  = getenv("VISUAL") or guiemacs
ncmpcpp = f"""{terminal} --class ncmpcpp -e ncmpcpp""" if terminal == 'alacritty' else f"""{terminal} -e ncmpcpp"""
htop = f"""{terminal} --class htop -e htop""" if terminal == 'alacritty' else f"""{terminal} -e htop"""
nmtui = f"""{terminal} --class nmtui -e nmtui""" if terminal == 'alacritty' else f"""{terminal} -e nmtui"""
khal = f"""{terminal} --class khal -e khal interactive""" if terminal == 'alacritty' else f"""{terminal} -e khal interactive"""
vim = f"""{terminal} --class vim -e vim""" if terminal == 'alacritty' else f"""{terminal} -e vim"""
nw_emacs = f"""{terminal} --class nw-emacs -e {tuiemacs}""" if terminal == 'alacritty' else f"""{terminal} -e {tuiemacs}"""
dired = f"""{terminal} -e {tuiemacs} -e '(dired (getenv \"HOME\"))'"""
tesseract_command = "maim -u -s -b 5 -l -c 0.3,0.4,0.6,0.4 -d 0.1 | xclip -selection clipboard -t image/png && notify-send -i camera-photo 'Screenshot' 'Saved to clipboard'"

logout = "rofi-logout qtile-logout"
menu = "rofi -show drun -theme qtile-menu"
clipboard = """rofi -theme qtile-clipboard -modi "clipboard:greenclip print" -show clipboard"""
emoji = "rofi -show emoji -theme qtile-emoji"
backlight_up = "dunst-backlight +1%"
backlight_down = "dunst-backlight 1%-"
volume_up = "dunst-volume -i 1"
volume_down = "dunst-volume -d 1"
volume_mute = "dunst-volume -t"
audio_play = "playerctl play-pause"
audio_next = "playerctl next"
audio_prev = "playerctl previous"
printscreen = "flameshot gui"
dgroups_key_binder = None
dgroups_app_rules = []  # type: list
follow_mouse_focus = True
bring_front_click = False
floats_kept_above = True
cursor_warp = False
floating_layout = layout.Floating(
    float_rules=[
        # Run the utility of `xprop` to see the wm class and name of an X client.
        ,*layout.Floating.default_float_rules,
        Match(wm_class="confirmreset"),  # gitk
        Match(wm_class="makebranch"),  # gitk
        Match(wm_class="maketag"),  # gitk
        Match(wm_class="ssh-askpass"),  # ssh-askpass
        Match(title="branchdialog"),  # gitk
        Match(title="pinentry"),  # GPG key password entry
    ]
)
auto_fullscreen = True
focus_on_window_activation = "smart"
reconfigure_screens = True

# If things like steam games want to auto-minimize themselves when losing
# focus, should we respect this or not?
auto_minimize = True

# When using the Wayland backend, this can be used to configure input devices.
wl_input_rules = None

# XXX: Gasp! We're lying here. In fact, nobody really uses or cares about this
# string besides java UI toolkits; you can see several discussions on the
# mailing lists, GitHub issues, and other WM documentation that suggest setting
# this string if your java app doesn't work correctly. We may as well just lie
# and say that we're a working one by default.
#
# We choose LG3D to maximize irony: it is a 3D non-reparenting WM written in
# java that happens to be on java's whitelist.
wmname = "LG3D"
#+end_src
*** keybindings
#+begin_src python
keys = []
#+end_src
**** focus movements
#+begin_src python
focus_keys = [
    Key([mod], "h", lazy.layout.left(), desc="Move focus to left"),
    Key([mod], "l", lazy.layout.right(), desc="Move focus to right"),
    Key([mod], "j", lazy.layout.down(), desc="Move focus down"),
    Key([mod], "k", lazy.layout.up(), desc="Move focus up"),
    #Key([mod], "space", lazy.layout.next(), desc="Move window focus to other window"),
    Key([mod], "Left", lazy.layout.left(), desc="Move focus to left"),
    Key([mod], "Right", lazy.layout.right(), desc="Move focus to right"),
    Key([mod], "Down", lazy.layout.down(), desc="Move focus down"),
    Key([mod], "Up", lazy.layout.up(), desc="Move focus up"),
]

keys.extend(focus_keys)
#+end_src
