index.html
<div id="outline-container-org1a49af8" class="outline-4">
<h4 id="org1a49af8">variables</h4>
<div class="outline-text-4" id="text-org1a49af8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">mod</span> = <span style="color: #bc8f8f;">"mod4"</span>

<span style="color: #b8860b;">terminal</span> = getenv(<span style="color: #bc8f8f;">"TERMINAL"</span>) <span style="color: #4169e1;">or</span> guess_terminal()
<span style="color: #b8860b;">filemanager</span> = getenv(<span style="color: #bc8f8f;">"FILE"</span>) <span style="color: #4169e1;">or</span> <span style="color: #bc8f8f;">"thunar"</span>
<span style="color: #b8860b;">browser</span> = getenv(<span style="color: #bc8f8f;">"BROWSER"</span>) <span style="color: #4169e1;">or</span> <span style="color: #bc8f8f;">"firefox"</span>
<span style="color: #b8860b;">mail_app</span> = getenv(<span style="color: #bc8f8f;">"MAIL_APP"</span>) <span style="color: #4169e1;">or</span> <span style="color: #bc8f8f;">"thunderbird"</span>
<span style="color: #b8860b;">guiemacs</span> = <span style="color: #bc8f8f;">"emacsclient -c -a emacs"</span>
<span style="color: #b8860b;">tuiemacs</span> = <span style="color: #bc8f8f;">"emacsclient -t -a emacs"</span>
<span style="color: #b8860b;">visual</span>  = getenv(<span style="color: #bc8f8f;">"VISUAL"</span>) <span style="color: #4169e1;">or</span> guiemacs
<span style="color: #b8860b;">ncmpcpp</span> = f<span style="color: #bc8f8f;">"""{terminal} --class ncmpcpp -e ncmpcpp"""</span> <span style="color: #4169e1;">if</span> terminal == <span style="color: #bc8f8f;">'alacritty'</span> <span style="color: #4169e1;">else</span> f<span style="color: #bc8f8f;">"""{terminal} -e ncmpcpp"""</span>
<span style="color: #b8860b;">htop</span> = f<span style="color: #bc8f8f;">"""{terminal} --class htop -e htop"""</span> <span style="color: #4169e1;">if</span> terminal == <span style="color: #bc8f8f;">'alacritty'</span> <span style="color: #4169e1;">else</span> f<span style="color: #bc8f8f;">"""{terminal} -e htop"""</span>
<span style="color: #b8860b;">nmtui</span> = f<span style="color: #bc8f8f;">"""{terminal} --class nmtui -e nmtui"""</span> <span style="color: #4169e1;">if</span> terminal == <span style="color: #bc8f8f;">'alacritty'</span> <span style="color: #4169e1;">else</span> f<span style="color: #bc8f8f;">"""{terminal} -e nmtui"""</span>
<span style="color: #b8860b;">khal</span> = f<span style="color: #bc8f8f;">"""{terminal} --class khal -e khal interactive"""</span> <span style="color: #4169e1;">if</span> terminal == <span style="color: #bc8f8f;">'alacritty'</span> <span style="color: #4169e1;">else</span> f<span style="color: #bc8f8f;">"""{terminal} -e khal interactive"""</span>
<span style="color: #b8860b;">vim</span> = f<span style="color: #bc8f8f;">"""{terminal} --class vim -e vim"""</span> <span style="color: #4169e1;">if</span> terminal == <span style="color: #bc8f8f;">'alacritty'</span> <span style="color: #4169e1;">else</span> f<span style="color: #bc8f8f;">"""{terminal} -e vim"""</span>
<span style="color: #b8860b;">nw_emacs</span> = f<span style="color: #bc8f8f;">"""{terminal} --class nw-emacs -e {tuiemacs}"""</span> <span style="color: #4169e1;">if</span> terminal == <span style="color: #bc8f8f;">'alacritty'</span> <span style="color: #4169e1;">else</span> f<span style="color: #bc8f8f;">"""{terminal} -e {tuiemacs}"""</span>
<span style="color: #b8860b;">dired</span> = f<span style="color: #bc8f8f;">"""{terminal} -e {tuiemacs} -e '(dired (getenv \"HOME\"))'"""</span>
<span style="color: #b8860b;">tesseract_command</span> = <span style="color: #bc8f8f;">"maim -u -s -b 5 -l -c 0.3,0.4,0.6,0.4 -d 0.1 | xclip -selection clipboard -t image/png &amp;&amp; notify-send -i camera-photo 'Screenshot' 'Saved to clipboard'"</span>

<span style="color: #b8860b;">logout</span> = <span style="color: #bc8f8f;">"rofi-logout qtile-logout"</span>
<span style="color: #b8860b;">menu</span> = <span style="color: #bc8f8f;">"rofi -show drun -theme qtile-menu"</span>
<span style="color: #b8860b;">clipboard</span> = <span style="color: #bc8f8f;">"""rofi -theme qtile-clipboard -modi "clipboard:greenclip print" -show clipboard"""</span>
<span style="color: #b8860b;">emoji</span> = <span style="color: #bc8f8f;">"rofi -show emoji -theme qtile-emoji"</span>
<span style="color: #b8860b;">backlight_up</span> = <span style="color: #bc8f8f;">"dunst-backlight +1%"</span>
<span style="color: #b8860b;">backlight_down</span> = <span style="color: #bc8f8f;">"dunst-backlight 1%-"</span>
<span style="color: #b8860b;">volume_up</span> = <span style="color: #bc8f8f;">"dunst-volume -i 1"</span>
<span style="color: #b8860b;">volume_down</span> = <span style="color: #bc8f8f;">"dunst-volume -d 1"</span>
<span style="color: #b8860b;">volume_mute</span> = <span style="color: #bc8f8f;">"dunst-volume -t"</span>
<span style="color: #b8860b;">audio_play</span> = <span style="color: #bc8f8f;">"playerctl play-pause"</span>
<span style="color: #b8860b;">audio_next</span> = <span style="color: #bc8f8f;">"playerctl next"</span>
<span style="color: #b8860b;">audio_prev</span> = <span style="color: #bc8f8f;">"playerctl previous"</span>
<span style="color: #b8860b;">printscreen</span> = <span style="color: #bc8f8f;">"flameshot gui"</span>
<span style="color: #b8860b;">dgroups_key_binder</span> = <span style="color: #5f9ea0;">None</span>
<span style="color: #b8860b;">dgroups_app_rules</span> = []  <span style="color: #b22222;"># </span><span style="color: #b22222;">type: list</span>
<span style="color: #b8860b;">follow_mouse_focus</span> = <span style="color: #5f9ea0;">True</span>
<span style="color: #b8860b;">bring_front_click</span> = <span style="color: #5f9ea0;">False</span>
<span style="color: #b8860b;">floats_kept_above</span> = <span style="color: #5f9ea0;">True</span>
<span style="color: #b8860b;">cursor_warp</span> = <span style="color: #5f9ea0;">False</span>
<span style="color: #b8860b;">floating_layout</span> = layout.Floating(
    float_rules=[
        <span style="color: #b22222;"># </span><span style="color: #b22222;">Run the utility of `xprop` to see the wm class and name of an X client.</span>
        *layout.Floating.default_float_rules,
        Match(wm_class=<span style="color: #bc8f8f;">"confirmreset"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">gitk</span>
        Match(wm_class=<span style="color: #bc8f8f;">"makebranch"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">gitk</span>
        Match(wm_class=<span style="color: #bc8f8f;">"maketag"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">gitk</span>
        Match(wm_class=<span style="color: #bc8f8f;">"ssh-askpass"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">ssh-askpass</span>
        Match(title=<span style="color: #bc8f8f;">"branchdialog"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">gitk</span>
        Match(title=<span style="color: #bc8f8f;">"pinentry"</span>),  <span style="color: #b22222;"># </span><span style="color: #b22222;">GPG key password entry</span>
    ]
)
<span style="color: #b8860b;">auto_fullscreen</span> = <span style="color: #5f9ea0;">True</span>
<span style="color: #b8860b;">focus_on_window_activation</span> = <span style="color: #bc8f8f;">"smart"</span>
<span style="color: #b8860b;">reconfigure_screens</span> = <span style="color: #5f9ea0;">True</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">If things like steam games want to auto-minimize themselves when losing</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">focus, should we respect this or not?</span>
<span style="color: #b8860b;">auto_minimize</span> = <span style="color: #5f9ea0;">True</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">When using the Wayland backend, this can be used to configure input devices.</span>
<span style="color: #b8860b;">wl_input_rules</span> = <span style="color: #5f9ea0;">None</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">XXX: Gasp! We're lying here. In fact, nobody really uses or cares about this</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">string besides java UI toolkits; you can see several discussions on the</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">mailing lists, GitHub issues, and other WM documentation that suggest setting</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">this string if your java app doesn't work correctly. We may as well just lie</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">and say that we're a working one by default.</span>
<span style="color: #b22222;">#</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">We choose LG3D to maximize irony: it is a 3D non-reparenting WM written in</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">java that happens to be on java's whitelist.</span>
<span style="color: #b8860b;">wmname</span> = <span style="color: #bc8f8f;">"LG3D"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4adc307" class="outline-4">
<h4 id="org4adc307">keybindings</h4>
<div class="outline-text-4" id="text-org4adc307">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">keys</span> = []
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org39af37e"></a>focus movements<br />
<div class="outline-text-5" id="text-org39af37e">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">focus_keys</span> = [
    Key([mod], <span style="color: #bc8f8f;">"h"</span>, lazy.layout.left(), desc=<span style="color: #bc8f8f;">"Move focus to left"</span>),
    Key([mod], <span style="color: #bc8f8f;">"l"</span>, lazy.layout.right(), desc=<span style="color: #bc8f8f;">"Move focus to right"</span>),
    Key([mod], <span style="color: #bc8f8f;">"j"</span>, lazy.layout.down(), desc=<span style="color: #bc8f8f;">"Move focus down"</span>),
    Key([mod], <span style="color: #bc8f8f;">"k"</span>, lazy.layout.up(), desc=<span style="color: #bc8f8f;">"Move focus up"</span>),
    <span style="color: #b22222;">#</span><span style="color: #b22222;">Key([mod], "space", lazy.layout.next(), desc="Move window focus to other window"),</span>
    Key([mod], <span style="color: #bc8f8f;">"Left"</span>, lazy.layout.left(), desc=<span style="color: #bc8f8f;">"Move focus to left"</span>),
    Key([mod], <span style="color: #bc8f8f;">"Right"</span>, lazy.layout.right(), desc=<span style="color: #bc8f8f;">"Move focus to right"</span>),
    Key([mod], <span style="color: #bc8f8f;">"Down"</span>, lazy.layout.down(), desc=<span style="color: #bc8f8f;">"Move focus down"</span>),
    Key([mod], <span style="color: #bc8f8f;">"Up"</span>, lazy.layout.up(), desc=<span style="color: #bc8f8f;">"Move focus up"</span>),
]

keys.extend(focus_keys)
</pre>
</div>
</div>
</li>
