index.org
**** window movements
#+begin_src python
movement_keys = [
    Key([mod, "shift"], "h", lazy.layout.shuffle_left(), desc="Move window to the left"),
    Key([mod, "shift"], "l", lazy.layout.shuffle_right(), desc="Move window to the right"),
    Key([mod,"shift"], "j", lazy.layout.shuffle_down(), desc="Move window down"),
    Key([mod, "shift"], "k", lazy.layout.shuffle_up(), desc="Move window up"),

    Key([mod, "shift"], "Left", lazy.layout.shuffle_left(), desc="Move window to the left"),
    Key([mod, "shift"], "Right", lazy.layout.shuffle_right(), desc="Move window to the right"),
    Key([mod,"shift"], "Down", lazy.layout.shuffle_down(), desc="Move window down"),
    Key([mod, "shift"], "Up", lazy.layout.shuffle_up(), desc="Move window up"),
]

keys.extend(movement_keys)
#+end_src
**** resize
#+begin_src python
resize_keys = [
    Key([mod, "control"], "h", lazy.layout.grow_left(), desc="Grow window to the left"),
    Key([mod, "control"], "l", lazy.layout.grow_right(), desc="Grow window to the right"),
    Key([mod, "control"], "j", lazy.layout.grow_down(), desc="Grow window down"),
    Key([mod, "control"], "k", lazy.layout.grow_up(), desc="Grow window up"),

    Key([mod, "control"], "Left", lazy.layout.grow_left(), desc="Grow window to the left"),
    Key([mod, "control"], "Right", lazy.layout.grow_right(), desc="Grow window to the right"),
    Key([mod, "control"], "Down", lazy.layout.grow_down(), desc="Grow window down"),
    Key([mod, "control"], "Up", lazy.layout.grow_up(), desc="Grow window up"),
]

keys.extend(resize_keys)
#+end_src
**** layout keys
#+begin_src python
layout_keys = [
    Key([mod], "n", lazy.layout.normalize(), desc="Reset all window sizes"),
    Key(
        [mod, "shift"],
        "Return",
        lazy.layout.toggle_split(),
        desc="Toggle between split and unsplit sides of stack",
    ),
]

keys.extend(layout_keys)
#+end_src
**** multimedia_key
#+begin_src python
multimedia_keys = [
    Key([], "XF86MonBrightnessUp", lazy.spawn(backlight_up), desc="brightness up +1%"),
    Key([], "XF86MonBrightnessDown", lazy.spawn(backlight_down), desc="brightness down +1%"),
    Key([], "XF86AudioRaiseVolume", lazy.spawn(volume_up), desc="volume up +1%"),
    Key([], "XF86AudioLowerVolume", lazy.spawn(volume_down), desc="volume down +1%"),
    Key([], "XF86AudioMute", lazy.spawn(volume_mute), desc="volume mute"),
    Key([], "Print", lazy.spawn(printscreen), desc="print screen"),
    Key([], "XF86MyComputer", lazy.spawn(browser), desc="browser"),
    Key([], "XF86Mail", lazy.spawn(mail_app), desc="mail app"),
    Key([], "XF86AudioNext", lazy.spawn(audio_next), desc="next audio"),
    Key([], "XF86AudioPrev", lazy.spawn(audio_prev), desc="previous audio"),
]

keys.extend(multimedia_keys)
#+end_src
**** Application Keys
***** single modifier keys only
#+begin_src python
mod_keys = [
    Key([mod], "grave", lazy.spawn("dunstctl close"), desc="dunstctl close"),
    Key([mod], "Return", lazy.spawn(terminal), desc="Launch terminal"),
    Key([mod], "e", lazy.spawn(filemanager), desc="Launch file manager"),
    Key([mod], "Tab", lazy.screen.toggle_group(), desc="Toggle between groups"),
    Key([mod], "q", lazy.spawn(logout), desc="logout"),
    Key([mod],"c", lazy.spawn(clipboard), desc="clipboard"),
    Key([mod],"d", lazy.spawn(menu), desc="menu"),
    Key([mod],"Comma", lazy.spawn(emoji), desc="emoji"),
    Key([mod], "F4", lazy.window.kill(), desc="Kill focused window"),
    Key(["mod1"], "F4", lazy.window.kill(), desc="Kill focused window"),
    Key(
        [mod],
        "f",
        lazy.window.toggle_fullscreen(),
        desc="Toggle fullscreen on the focused window",
    ),
    Key([mod], "t", lazy.window.toggle_floating(), desc="Toggle floating on the focused window"),
]

keys.extend(mod_keys)
#+end_src
***** Mod + Alt (Mod1) keys
#+begin_src python
mod_alt_keys = [
    Key([mod, "mod1"], "Tab", lazy.next_layout(), desc="Toggle between layouts" ),
    Key([mod, "mod1"], "b", lazy.spawn("rofi-rbw"), desc="Web browser" ),
    Key([mod, "mod1"], "f", lazy.spawn(browser), desc="Web browser" ),
    Key([mod, "mod1"], "m", lazy.spawn(ncmpcpp), desc="Ncmpcpp" ),
    Key([mod, "mod1"], "h", lazy.spawn(htop), desc="htop" ),
    Key([mod, "mod1"], "n", lazy.spawn(visual), desc="visual editor" ),
    Key([mod, "mod1"], "p", lazy.spawn("rofi-pass"), desc="rofi frontend for pass" ),
    Key([mod, "mod1"], "t", lazy.spawn(mail_app), desc="Mail application" ),
    Key([mod, "mod1"], "w", lazy.spawn(nmtui), desc="NMtui" ),
    Key([mod, "mod1"], "v", lazy.spawn("pavucontrol"), desc="Launch pavucontrol"),

    Key([mod, "mod1"], "grave", lazy.spawn("dunstctl history-pop"), desc="dunst pop history"),
]

keys.extend(mod_alt_keys)
#+end_src
