index.html
<li><a id="orge70389f"></a>window movements<br />
<div class="outline-text-5" id="text-orge70389f">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">movement_keys</span> = [
    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"h"</span>, lazy.layout.shuffle_left(), desc=<span style="color: #bc8f8f;">"Move window to the left"</span>),
    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"l"</span>, lazy.layout.shuffle_right(), desc=<span style="color: #bc8f8f;">"Move window to the right"</span>),
    Key([mod,<span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"j"</span>, lazy.layout.shuffle_down(), desc=<span style="color: #bc8f8f;">"Move window down"</span>),
    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"k"</span>, lazy.layout.shuffle_up(), desc=<span style="color: #bc8f8f;">"Move window up"</span>),

    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"Left"</span>, lazy.layout.shuffle_left(), desc=<span style="color: #bc8f8f;">"Move window to the left"</span>),
    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"Right"</span>, lazy.layout.shuffle_right(), desc=<span style="color: #bc8f8f;">"Move window to the right"</span>),
    Key([mod,<span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"Down"</span>, lazy.layout.shuffle_down(), desc=<span style="color: #bc8f8f;">"Move window down"</span>),
    Key([mod, <span style="color: #bc8f8f;">"shift"</span>], <span style="color: #bc8f8f;">"Up"</span>, lazy.layout.shuffle_up(), desc=<span style="color: #bc8f8f;">"Move window up"</span>),
]

keys.extend(movement_keys)
</pre>
</div>
</div>
</li>
<li><a id="org4b1dbf1"></a>resize<br />
<div class="outline-text-5" id="text-org4b1dbf1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">resize_keys</span> = [
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"h"</span>, lazy.layout.grow_left(), desc=<span style="color: #bc8f8f;">"Grow window to the left"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"l"</span>, lazy.layout.grow_right(), desc=<span style="color: #bc8f8f;">"Grow window to the right"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"j"</span>, lazy.layout.grow_down(), desc=<span style="color: #bc8f8f;">"Grow window down"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"k"</span>, lazy.layout.grow_up(), desc=<span style="color: #bc8f8f;">"Grow window up"</span>),

    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"Left"</span>, lazy.layout.grow_left(), desc=<span style="color: #bc8f8f;">"Grow window to the left"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"Right"</span>, lazy.layout.grow_right(), desc=<span style="color: #bc8f8f;">"Grow window to the right"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"Down"</span>, lazy.layout.grow_down(), desc=<span style="color: #bc8f8f;">"Grow window down"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"Up"</span>, lazy.layout.grow_up(), desc=<span style="color: #bc8f8f;">"Grow window up"</span>),
]

keys.extend(resize_keys)
</pre>
</div>
</div>
</li>
<li><a id="org595f014"></a>layout keys<br />
<div class="outline-text-5" id="text-org595f014">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">layout_keys</span> = [
    Key([mod], <span style="color: #bc8f8f;">"n"</span>, lazy.layout.normalize(), desc=<span style="color: #bc8f8f;">"Reset all window sizes"</span>),
    Key(
        [mod, <span style="color: #bc8f8f;">"shift"</span>],
        <span style="color: #bc8f8f;">"Return"</span>,
        lazy.layout.toggle_split(),
        desc=<span style="color: #bc8f8f;">"Toggle between split and unsplit sides of stack"</span>,
    ),
]

keys.extend(layout_keys)
</pre>
</div>
</div>
</li>
<li><a id="orgab8d26b"></a>multimedia_key<br />
<div class="outline-text-5" id="text-orgab8d26b">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">multimedia_keys</span> = [
    Key([], <span style="color: #bc8f8f;">"XF86MonBrightnessUp"</span>, lazy.spawn(backlight_up), desc=<span style="color: #bc8f8f;">"brightness up +1%"</span>),
    Key([], <span style="color: #bc8f8f;">"XF86MonBrightnessDown"</span>, lazy.spawn(backlight_down), desc=<span style="color: #bc8f8f;">"brightness down +1%"</span>),
    Key([], <span style="color: #bc8f8f;">"XF86AudioRaiseVolume"</span>, lazy.spawn(volume_up), desc=<span style="color: #bc8f8f;">"volume up +1%"</span>),
    Key([], <span style="color: #bc8f8f;">"XF86AudioLowerVolume"</span>, lazy.spawn(volume_down), desc=<span style="color: #bc8f8f;">"volume down +1%"</span>),
    Key([], <span style="color: #bc8f8f;">"XF86AudioMute"</span>, lazy.spawn(volume_mute), desc=<span style="color: #bc8f8f;">"volume mute"</span>),
    Key([], <span style="color: #bc8f8f;">"Print"</span>, lazy.spawn(printscreen), desc=<span style="color: #bc8f8f;">"print screen"</span>),
    Key([], <span style="color: #bc8f8f;">"XF86MyComputer"</span>, lazy.spawn(browser), desc=<span style="color: #bc8f8f;">"browser"</span>),
    Key([], <span style="color: #bc8f8f;">"XF86Mail"</span>, lazy.spawn(mail_app), desc=<span style="color: #bc8f8f;">"mail app"</span>),
    Key([], <span style="color: #bc8f8f;">"XF86AudioNext"</span>, lazy.spawn(audio_next), desc=<span style="color: #bc8f8f;">"next audio"</span>),
    Key([], <span style="color: #bc8f8f;">"XF86AudioPrev"</span>, lazy.spawn(audio_prev), desc=<span style="color: #bc8f8f;">"previous audio"</span>),
]

keys.extend(multimedia_keys)
</pre>
</div>
</div>
</li>
<li><a id="org0c4ecb3"></a>Application Keys<br />
<ul class="org-ul">
<li><a id="org7a56946"></a>single modifier keys only<br />
<div class="outline-text-6" id="text-org7a56946">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">mod_keys</span> = [
    Key([mod], <span style="color: #bc8f8f;">"grave"</span>, lazy.spawn(<span style="color: #bc8f8f;">"dunstctl close"</span>), desc=<span style="color: #bc8f8f;">"dunstctl close"</span>),
    Key([mod], <span style="color: #bc8f8f;">"Return"</span>, lazy.spawn(terminal), desc=<span style="color: #bc8f8f;">"Launch terminal"</span>),
    Key([mod], <span style="color: #bc8f8f;">"e"</span>, lazy.spawn(filemanager), desc=<span style="color: #bc8f8f;">"Launch file manager"</span>),
    Key([mod], <span style="color: #bc8f8f;">"Tab"</span>, lazy.screen.toggle_group(), desc=<span style="color: #bc8f8f;">"Toggle between groups"</span>),
    Key([mod], <span style="color: #bc8f8f;">"q"</span>, lazy.spawn(logout), desc=<span style="color: #bc8f8f;">"logout"</span>),
    Key([mod],<span style="color: #bc8f8f;">"c"</span>, lazy.spawn(clipboard), desc=<span style="color: #bc8f8f;">"clipboard"</span>),
    Key([mod],<span style="color: #bc8f8f;">"d"</span>, lazy.spawn(menu), desc=<span style="color: #bc8f8f;">"menu"</span>),
    Key([mod],<span style="color: #bc8f8f;">"Comma"</span>, lazy.spawn(emoji), desc=<span style="color: #bc8f8f;">"emoji"</span>),
    Key([mod], <span style="color: #bc8f8f;">"F4"</span>, lazy.window.kill(), desc=<span style="color: #bc8f8f;">"Kill focused window"</span>),
    Key([<span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"F4"</span>, lazy.window.kill(), desc=<span style="color: #bc8f8f;">"Kill focused window"</span>),
    Key(
        [mod],
        <span style="color: #bc8f8f;">"f"</span>,
        lazy.window.toggle_fullscreen(),
        desc=<span style="color: #bc8f8f;">"Toggle fullscreen on the focused window"</span>,
    ),
    Key([mod], <span style="color: #bc8f8f;">"t"</span>, lazy.window.toggle_floating(), desc=<span style="color: #bc8f8f;">"Toggle floating on the focused window"</span>),
]

keys.extend(mod_keys)
</pre>
</div>
</div>
</li>
<li><a id="orgd6f9aeb"></a>Mod + Alt (Mod1) keys<br />
<div class="outline-text-6" id="text-orgd6f9aeb">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">mod_alt_keys</span> = [
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"Tab"</span>, lazy.next_layout(), desc=<span style="color: #bc8f8f;">"Toggle between layouts"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"b"</span>, lazy.spawn(<span style="color: #bc8f8f;">"rofi-rbw"</span>), desc=<span style="color: #bc8f8f;">"Web browser"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"f"</span>, lazy.spawn(browser), desc=<span style="color: #bc8f8f;">"Web browser"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"m"</span>, lazy.spawn(ncmpcpp), desc=<span style="color: #bc8f8f;">"Ncmpcpp"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"h"</span>, lazy.spawn(htop), desc=<span style="color: #bc8f8f;">"htop"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"n"</span>, lazy.spawn(visual), desc=<span style="color: #bc8f8f;">"visual editor"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"p"</span>, lazy.spawn(<span style="color: #bc8f8f;">"rofi-pass"</span>), desc=<span style="color: #bc8f8f;">"rofi frontend for pass"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"t"</span>, lazy.spawn(mail_app), desc=<span style="color: #bc8f8f;">"Mail application"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"w"</span>, lazy.spawn(nmtui), desc=<span style="color: #bc8f8f;">"NMtui"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"v"</span>, lazy.spawn(<span style="color: #bc8f8f;">"pavucontrol"</span>), desc=<span style="color: #bc8f8f;">"Launch pavucontrol"</span>),

    Key([mod, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"grave"</span>, lazy.spawn(<span style="color: #bc8f8f;">"dunstctl history-pop"</span>), desc=<span style="color: #bc8f8f;">"dunst pop history"</span>),
]

keys.extend(mod_alt_keys)
</pre>
</div>
</div>
</li>
