index.org
***** Mod + Shift keys
#+begin_src python
mod_shift_keys = [
    Key([mod, "Shift"], "t", lazy.spawn(tesseract_command), desc="tesseract" ),
    Key([mod, "Shift"], "grave", lazy.spawn("dunstctl context"), desc="dunst context" ),
]

keys.extend(mod_shift_keys)
#+end_src
***** Mod + Shift + Alt keys
#+begin_src python
mod_shift_alt_keys = [
    Key([mod, "Shift", "mod1"], "e", lazy.spawn(dired), desc="Launch dired"),
    Key([mod, "Shift", "mod1"], "n", lazy.spawn(nw_emacs), desc="Launch emacs in terminal"),
]

keys.extend(mod_shift_alt_keys)
#+end_src
***** mod + control keys
#+begin_src python
mod_control_keys = [
    Key([mod, "control"], "grave", lazy.spawn("dunstctl action"), desc="dunstctl action"),
    Key([mod, "control"], "r", lazy.reload_config(), desc="Reload the config"),
]

keys.extend(mod_control_keys)
#+end_src

This is from the default
#+begin_src python :tangle no
keys = [
    Key([mod], "r", lazy.spawncmd(), desc="Spawn a command using a prompt widget"),

    # fn keys
]
#+end_src

***** wayland keys
#+begin_src python
# Add key bindings to switch VTs in Wayland.
# We can't check qtile.core.name in default config as it is loaded before qtile is started
# We therefore defer the check until the key binding is run by using .when(func=...)
for vt in range(1, 8):
    keys.append(
        Key(
            ["control", "mod1"],
            f"f{vt}",
            lazy.core.change_vt(vt).when(func=lambda: qtile.core.name == "wayland"),
            desc=f"Switch to VT{vt}",
        )
    )

#+end_src
*** groups
#+begin_src python
groups = [Group(i) for i in "123456789"]

for i in groups:
    keys.extend(
        [
            # mod1 + group number = switch to group
            Key(
                [mod],
                i.name,
                lazy.group[i.name].toscreen(),
                desc="Switch to group {}".format(i.name),
            ),
            # mod1 + shift + group number = switch to & move focused window to group
            Key(
                [mod, "shift"],
                i.name,
                lazy.window.togroup(i.name, switch_group=True),
                desc="Switch to & move focused window to group {}".format(i.name),
            ),
            # Or, use below if you prefer not to switch to that group.
            # # mod1 + shift + group number = move focused window to group
            # Key([mod, "shift"], i.name, lazy.window.togroup(i.name),
            #     desc="move focused window to group {}".format(i.name)),
        ]
    )
#+end_src
*** layouts
#+begin_src python
layouts = [
    layout.Columns(border_focus_stack=["#d75f5f", "#8f3d3d"], border_width=4),
    layout.Max(),
    # Try more layouts by unleashing below layouts.
    # layout.Stack(num_stacks=2),
    # layout.Bsp(),
    # layout.Matrix(),
    # layout.MonadTall(),
    # layout.MonadWide(),
    # layout.RatioTile(),
    # layout.Tile(),
    # layout.TreeTab(),
    # layout.VerticalTile(),
    # layout.Zoomy(),
]
#+end_src
*** default widgets and extensions
#+begin_src python
widget_defaults = dict(
    font="sans",
    fontsize=12,
    padding=3,
)
extension_defaults = widget_defaults.copy()
#+end_src
