index.html
<li><a id="org589ca3e"></a>Mod + Shift keys<br />
<div class="outline-text-6" id="text-org589ca3e">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">mod_shift_keys</span> = [
    Key([mod, <span style="color: #bc8f8f;">"Shift"</span>], <span style="color: #bc8f8f;">"t"</span>, lazy.spawn(tesseract_command), desc=<span style="color: #bc8f8f;">"tesseract"</span> ),
    Key([mod, <span style="color: #bc8f8f;">"Shift"</span>], <span style="color: #bc8f8f;">"grave"</span>, lazy.spawn(<span style="color: #bc8f8f;">"dunstctl context"</span>), desc=<span style="color: #bc8f8f;">"dunst context"</span> ),
]

keys.extend(mod_shift_keys)
</pre>
</div>
</div>
</li>
<li><a id="orgda82347"></a>Mod + Shift + Alt keys<br />
<div class="outline-text-6" id="text-orgda82347">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">mod_shift_alt_keys</span> = [
    Key([mod, <span style="color: #bc8f8f;">"Shift"</span>, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"e"</span>, lazy.spawn(dired), desc=<span style="color: #bc8f8f;">"Launch dired"</span>),
    Key([mod, <span style="color: #bc8f8f;">"Shift"</span>, <span style="color: #bc8f8f;">"mod1"</span>], <span style="color: #bc8f8f;">"n"</span>, lazy.spawn(nw_emacs), desc=<span style="color: #bc8f8f;">"Launch emacs in terminal"</span>),
]

keys.extend(mod_shift_alt_keys)
</pre>
</div>
</div>
</li>
<li><a id="org9d14e7d"></a>mod + control keys<br />
<div class="outline-text-6" id="text-org9d14e7d">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">mod_control_keys</span> = [
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"grave"</span>, lazy.spawn(<span style="color: #bc8f8f;">"dunstctl action"</span>), desc=<span style="color: #bc8f8f;">"dunstctl action"</span>),
    Key([mod, <span style="color: #bc8f8f;">"control"</span>], <span style="color: #bc8f8f;">"r"</span>, lazy.reload_config(), desc=<span style="color: #bc8f8f;">"Reload the config"</span>),
]

keys.extend(mod_control_keys)
</pre>
</div>

<p>
This is from the default
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b8860b;">keys</span> = [
    Key([mod], <span style="color: #bc8f8f;">"r"</span>, lazy.spawncmd(), desc=<span style="color: #bc8f8f;">"Spawn a command using a prompt widget"</span>),

    <span style="color: #b22222;"># </span><span style="color: #b22222;">fn keys</span>
]
</pre>
</div>
</div>
</li>
